local info = gg.getTargetPackage() 
if info == "com.dodjoy.mjdx.t9" then
else
os.exit(print("♥𝑯𝒂̉𝒊 𝑺𝒄𝒓𝒊𝒑𝒕☠️\n \n➣Vᴜɪ Lᴏ̀ɴɢ Cʜᴏ̣ɴ Đᴜ́ɴɢ Tʀᴏ̀ Cʜᴏ̛ɪ Cᴜ̉ᴀ Sᴄʀɪᴘᴛ...\n➣ʜᴏᴀ̣̆ᴄ ɢᴀᴍᴇ ᴆᴀ̃ ᴆᴜ̛ᴏ̛̣ᴄ ᴄᴀ̣̂ᴘ ɴʜᴀ̣̂ᴛ ᴘʜɪᴇ̂ɴ ʙᴀ̉ɴ ᴍᴏ̛́ɪ...\n➣ʜᴀ̃ʏ ʟɪᴇ̂ɴ ʜᴇ̣̂ ᴢᴀʟᴏ ᴀᴅᴍɪɴ ᴆᴇ̂̉ ᴜᴘᴅᴀᴛᴇ ᴘʜɪᴇ̂ɴ ʙᴀ̉ɴ ᴍᴏ̛́ɪ...\n\n • Liên Hệ Zalo: 0375574755📱 •"))
end 

if gg.VERSION > "3" then 
os.exit(print("♥𝑯𝒂̉𝒊 𝑺𝒄𝒓𝒊𝒑𝒕☠️\n \n➣ᴘʜɪᴇ̂ɴ ʙᴀ̉ɴ ꜱᴄʀɪᴘᴛ ᴆᴀ̃ ᴄᴜ̃...\n➣ᴋʜᴏ̂ɴɢ ᴛʜᴇ̂̉ ᴄʜᴀ̣ʏ ᴛʀᴇ̂ɴ ᴘʜɪᴇ̂ɴ ʙᴀ̉ɴ ᴍᴏ̛́ɪ ᴄᴜ̉ᴀ ɢᴀᴍᴇ...\n➣ʜᴀ̃ʏ ᴄᴀ̣̂ᴘ ɴʜᴀ̣̂ᴛ ɴʜᴀ̣̂ᴛ ꜱᴄʀɪᴘᴛ ʙᴀ̉ɴ ᴜᴘᴅᴀᴛᴇ ᴍᴏ̛́ɪ ɴʜᴀ̂́ᴛ ᴆᴇ̂̉ ꜱᴜ̛̉ ᴅᴜ̣ɴɢ...\n\n • Liên Hệ Zalo: 0375574755📱 •"))
end 



gg.sleep(100) 
gg.getTargetInfo()
gg.alert("𝙶𝙰𝙼𝙴 𝙽𝙰𝙼𝙴 : 𝙳𝙷𝙲𝙳 𝙰𝙷𝙸𝙷𝙸\n𝚂𝙲𝚁𝙸𝙿𝚃 𝚅𝙴𝚁𝚂𝙸𝙾𝙽 : 2.0\n𝙻𝙰𝚂𝚃 𝚄𝙿𝙳𝙰𝚃𝙴 : 09/12/2024\nMᴀᴅᴇ Bʏ Hᴏᴀ̀ɴɢ Nᴀᴍ Hᴀ̉ɪ\nSᴄʀɪᴘᴛ Pᴜʙʟɪsʜᴇᴅ ɪɴ ©2024", "[𝙽𝙴𝚇𝚃]")
gg.sleep(50)
gg.sleep(50)




function MenuBattle()
local HNHH = gg.choice({
"➣ [™𝙷𝙰𝙲𝙺 𝚃𝙸𝙼𝙴™]💥",
"➣ [™𝙾𝙽𝙴𝙷𝙸𝚃+𝙶𝙾𝙳𝙼𝙾𝙳™]❤️",
"➣ [™𝚂𝙺𝙸𝙻𝙻 𝚅𝙸𝙿™]💢",
"➣ [™𝚂𝙿𝙴𝙴𝙳 𝚇𝟸™]💦",
"➣ [™𝙷𝙰𝙲𝙺 𝙳𝙰𝙼𝙰𝙶𝙴™]🔥",
"[𝙴𝚇𝙸𝚃]"
}, nil,"❤Yᴏᴜᴛᴜʙᴇ :: ʜᴀ̉ɪ sᴄʀɪᴘᴛ🍀\n🎮G𝙰𝙼𝙴: 𝙳𝙷𝙲𝙷 𝙰𝙷𝙸𝙷𝙸\n💭V𝙴𝚁𝚂𝙸𝙾𝙽: 1.00 - 2.99 \n-------------------------------------------")

if HNHH == nil then else
if HNHH == 1 then HackTime() end
if HNHH == 2 then VipVip() end
if HNHH == 3 then SkillVip() end
if HNHH == 4 then SpeedX2() end
if HNHH == 5 then HackDamage() end
if HNHH == 6 then EXITALL() end

end
HVH = -1
end





function HackTime()
local input = gg.prompt(
	{'🔰Edit Số Time Bạn Muốn🔰:'},
	{[1] = "☛☚"},
	{[1] = 'number'})
if input == nil then gg.toast("🔥Đᴀ̃ Hᴜ̉ʏ🔥") MenuBattle() os.exit() end				
Class = "LevelMonsterMgr"
Offset = 0x54
Type = 4 
Field() 
gg.refineNumber("0~300",4)
gg.getResults(99999)
gg.editAll(input[1],4)
gg.clearResults()
gg.alert('✅𝙷𝙰𝙲𝙺 𝚃𝙸𝙼𝙴✅')
end








function VipVip()
local HNH = gg.alert('❤Yᴏᴜᴛᴜʙᴇ :: ʜᴀ̉ɪ sᴄʀɪᴘᴛ🍀\n--------------------------------------------\n\n➣ 𝙵𝚄𝙽𝙲𝚃𝙸𝙾𝙽 𝙼𝙾𝙳:\n[™𝙾𝙽𝙴𝙷𝙸𝚃+𝙶𝙾𝙳𝙼𝙾𝙳™] ❤️\n\n➣ Lưu Ý:\n➣ Hãy Vào 1 Trận Đấu Bất Kỳ Tùy Theo Chế Độ Chơi.\n➣ Vào Trong Trận Đợi 3s Rồi Thoát Ra Sảnh Nhé.\n➣ Thoát Ra Tới Sảnh Hãy Bật Hack Nhé.\n➣ Chức Năng Này Chỉ Cần Bật 1 Lần Là Sài Mãi Nha.\n➣ Hạn Chế Bật Đi Bật Lại Nhiều Lần.', '[𝙰𝙲𝚃𝙸𝚅𝙰𝚃𝙴]')
if HNH == nil then return 
else

if HNH == 1 then ONVip() end
end
::ni::
end



function ONVip()
Class = "MonsterCfg"
Offset = 0x30 
Type = 4 
Field() 
gg.refineNumber("2~999999",4)
gg.getResults(99999)
gg.editAll(-1,4)
gg.clearResults()

Class = "MonsterCfg"
Offset = 0x40 
Type = 4 
Field() 
gg.refineNumber("2~999999",4)
gg.getResults(99999)
gg.editAll(0,4)
gg.clearResults()
gg.alert('✅𝙰𝙲𝚃𝙸𝚅𝙰𝚃𝙴✅')
end






function SkillVip()
local HNH1 = gg.alert('❤Yᴏᴜᴛᴜʙᴇ :: ʜᴀ̉ɪ sᴄʀɪᴘᴛ🍀\n--------------------------------------------\n\n➣ 𝙵𝚄𝙽𝙲𝚃𝙸𝙾𝙽 𝙼𝙾𝙳:\n\n[™𝚂𝙺𝙸𝙻𝙻 𝚅𝙸𝙿™] 💢\n\n➣ Lưu Ý:\n➣ Chức Năng Này Bật Ở Trong Trận Nhé.\n➣ Khi Nào Có 1 Vài Skill Kỹ Năng Đánh Tầm Xa Mới Bật Chức Năng Này.\n➣ Chỉ Cần Bật 1 Lần Sau Các Trận Khác Không Cần Bật Nữa.\n➣ Nhưng Vẫn Có Thể Bật Lại Vài Lần Để Các Chức Năng Hoạt Động Tốt.', '[𝙰𝙲𝚃𝙸𝚅𝙰𝚃𝙴]', '[𝚁𝙴𝚂𝙴𝚃]')
if HNH1 == nil then return 
else
if HNH1 == 1 then ONSkill() end
if HNH1 == 2 then OFFSkill() end
end
::ni::
end

function ONSkill()
Class = "SkillRuleEventSelectRandomEnemy"
Offset = 0x3C 
Type = 4 
Field() 
gg.refineNumber("1",4)
gg.getResults(99999)
gg.editAll(8,4)
gg.clearResults()
gg.alert('✅𝚂𝙺𝙸𝙻𝙻✅')
end

function OFFSkill()
Class = "SkillRuleEventSelectRandomEnemy"
Offset = 0x3C 
Type = 4 
Field() 
gg.refineNumber("8",4)
gg.getResults(99999)
gg.editAll(1,4)
gg.clearResults()
gg.alert('❌𝚂𝙺𝙸𝙻𝙻❌')
end




function SpeedX2()
local HNH2 = gg.alert('❤Yᴏᴜᴛᴜʙᴇ :: ʜᴀ̉ɪ sᴄʀɪᴘᴛ🍀\n--------------------------------------------\n\n➣ 𝙵𝚄𝙽𝙲𝚃𝙸𝙾𝙽 𝙼𝙾𝙳:\n[™𝚂𝙿𝙴𝙴𝙳 𝚇𝟸™]💦\n\n➣ Lưu Ý:\n➣ Chức Năng Bật Trong Trận Hay Sảnh Đều Được.\n➣ Nhớ Là Phải Bật Chức Năng Speed Sau Nhất Nhé.', '[𝙰𝙲𝚃𝙸𝚅𝙰𝚃𝙴]', '[𝚁𝙴𝚂𝙴𝚃]')
if HNH2 == nil then return 
else
if HNH2 == 1 then ONSpeed() end
if HNH2 == 2 then OFFSpeed() end
end
::ni::
end

function ONSpeed()
function searchValue(t,hai1,hai2)
gg.clearResults()
gg.clearList()
rt={}
gg.setRanges(hai1)
gg.setVisible(false)
gg.searchNumber(t[1], hai2)
local r = gg.getResults(9)
if #r==0 then goto HoangNamHai end
for it=2,#t do
for i=1,#r do
r[i].address=r[i].address+t[it][2]
end
local rr=gg.getValues(r)
tt={}
for i=1,#rr do
   if rr[i].value== t[it][1] then
   ii=#tt+1
   tt[ii]={}
   tt[ii].address=rr[i].address-t[it][2]
   tt[ii].flags=4
   end
end
if #tt==0 then goto HoangNamHai end
r=gg.getValues(tt)
if it==#t then rt=r goto HoangNamHai end
end
::HoangNamHai::
return rt
end
function searchEdit(hnh1,hnh2,hnh3)
if #r>0 then
tt={}
for i=1,#r do
ii=#tt+1 tt[ii]={}
tt[ii].address=r[i].address +hnh1
tt[ii].flags=hnh2
tt[ii].value=hnh3
tt[ii].freeze = true
tt[ii].freezeType = gg.FREEZE_NORMAL
gg.addListItems(tt)
t = nil
end
gg.setValues(tt)
end end
r=searchValue({"4392630932057270955",{"4392630932057270955",0*4}},32,32)
if #r == 0 then else
searchEdit(-1*4,16, 2)
gg.clearResults()
gg.alert('✅𝚂𝙿𝙴𝙴𝙳 𝚇𝟸✅')
end
end

function OFFSpeed()
function searchValue(t,hai1,hai2)
gg.clearResults()
gg.clearList()
rt={}
gg.setRanges(hai1)
gg.setVisible(false)
gg.searchNumber(t[1], hai2)
local r = gg.getResults(9)
if #r==0 then goto HoangNamHai end
for it=2,#t do
for i=1,#r do
r[i].address=r[i].address+t[it][2]
end
local rr=gg.getValues(r)
tt={}
for i=1,#rr do
   if rr[i].value== t[it][1] then
   ii=#tt+1
   tt[ii]={}
   tt[ii].address=rr[i].address-t[it][2]
   tt[ii].flags=4
   end
end
if #tt==0 then goto HoangNamHai end
r=gg.getValues(tt)
if it==#t then rt=r goto HoangNamHai end
end
::HoangNamHai::
return rt
end
function searchEdit(hnh1,hnh2,hnh3)
if #r>0 then
tt={}
for i=1,#r do
ii=#tt+1 tt[ii]={}
tt[ii].address=r[i].address +hnh1
tt[ii].flags=hnh2
tt[ii].value=hnh3
tt[ii].freeze = true
tt[ii].freezeType = gg.FREEZE_NORMAL
gg.addListItems(tt)
t = nil
end
gg.setValues(tt)
end end
r=searchValue({"4392630932057270955",{"4392630932057270955",0*4}},32,32)
if #r == 0 then else
searchEdit(-1*4,16, 1)
gg.clearList()
gg.clearResults()
gg.alert('❌𝚂𝙿𝙴𝙴𝙳 𝚇𝟸❌')
end
end







function HackDamage()
local HNH3 = gg.alert('❤Yᴏᴜᴛᴜʙᴇ :: ʜᴀ̉ɪ sᴄʀɪᴘᴛ🍀\n--------------------------------------------\n\n➣ 𝙵𝚄𝙽𝙲𝚃𝙸𝙾𝙽 𝙼𝙾𝙳:\n[™𝙷𝙰𝙲𝙺 𝙳𝙰𝙼𝙰𝙶𝙴™]🔥\n\n➣ Lưu Ý:\n➣ Chức Năng Bật Trong Trận Nhé.\n➣ Bật Và Điền Số Dame Acc Của Bạn Vào Menu Nha.\n➣ Chơi Tới Boss Cuối Thì Clear Đi Nhé.\n➣ Bắt Buộc Phải Clear Mới Tính Trận Đấu Nha, Ghi Số Dame Cũ Vào Là Ok.', '[𝙰𝙲𝚃𝙸𝚅𝙰𝚃𝙴]', '[𝙲𝙻𝙴𝙰𝚁]')
if HNH3 == nil then return 
else
if HNH3 == 1 then ONHackDamage() end
if HNH3 == 2 then ClearHackDamage() end
end
::ni::
end

function ONHackDamage()
local input = gg.prompt(
	{'🔰Điền Giá Trị Damage🔰:'},
	{[1] = "☛☚"},
	{[1] = 'number'})
if input == nil then gg.toast("🔥Đᴀ̃ Hᴜ̉ʏ🔥") HackDamage() MenuBattle() os.exit() end		
Class = "ActorAttrData"
Offset = 0x1C 
Type = 4 
Field() 
gg.refineNumber(input[1],4)
gg.getResults(99999)
gg.editAll(5060902,4)
gg.clearResults()
gg.alert('✅𝙷𝙰𝙲𝙺 𝙳𝙰𝙼𝙰𝙶𝙴✅')
end

function ClearHackDamage()
local input = gg.prompt(
	{'🔰Clear Về Giá Trị Gốc🔰:'},
	{[1] = "☛☚"},
	{[1] = 'number'})
if input == nil then gg.toast("🔥Đᴀ̃ Hᴜ̉ʏ🔥") HackDamage() MenuBattle() os.exit() end			
gg.searchNumber(5060902,4)
gg.getResults(99999)
gg.editAll(input[1],4)
gg.clearResults()
gg.alert('❌𝙷𝙰𝙲𝙺 𝙳𝙰𝙼𝙰𝙶𝙴❌')
end









function EXITALL()
gg.toast('♥ᴍᴏᴅ ʙʏ ʜᴀ̉ɪ sᴄʀɪᴘᴛ♥')
gg.alert("❤️Yᴏᴜᴛᴜʙᴇ :: ʜᴀ̉ɪ sᴄʀɪᴘᴛ🍀")
print('☞♥Zᴀʟᴏ: 0375574755♥☜')
os.exit()
end



































-- (•‿•)(・∀・)◉‿◉｡◕‿◕｡(. ❛ ᴗ ❛.)(θ‿θ)(✷‿✷)(◔‿◔)(◕ᴗ◕✿)(ʘᴗʘ✿)(人 •͈ᴗ•͈)(◍•ᴗ•◍)( ╹▽╹ )(≧▽≦)(☆▽☆)(✯ᴗ✯)( ╹▽╹ )(≧▽≦)(☆▽☆)(✯ᴗ✯)ಡ ͜ ʖ ಡ(ㆁωㆁ)(*´ω｀*)( ꈍᴗꈍ)(✿^‿^)^_________^(◡ ω ◡)( ´◡‿ゝ◡`)(｡•̀ᴗ-)✧✧◝(⁰▿⁰)◜✧(◠‿・)—☆٩(◕‿◕｡)۶(´ ∀ ` *)(* ^ ω ^)(o^▽^o)(￣ω￣)(o･ω･o)ヽ(*・ω・)ﾉヽ(*・ω・)ﾉ(o´▽`o)(o_ _)ﾉ彡☆(o_ _)ﾉ彡☆(＠＾◡＾)ヽ(*・ω・)ﾉ(o_ _)ﾉ彡☆(^人^)(o´▽`o)(*´▽`*)｡ﾟ( ﾟ^∀^ﾟ)ﾟ｡( ´ ω ` )(((o(*°▽°*)o)))(≧◡≦)(⌒ω⌒)(＾▽＾)(´• ω •`)(o´∀`o)∑d(°∀°d)╰(▔∀▔)╯(─‿‿─)(*^‿^*)ヽ(o^ ^o)ﾉ(✯◡✯)(◕‿◕)(*≧ω≦*)ヽ(o＾▽＾o)ノ＼(≧▽≦)／(⌒‿⌒)(☆▽☆)(*°▽°*)(✧ω✧)ヽ(*⌒▽⌒*)ﾉ(´｡• ᵕ •｡`)ヽ(>∀<☆)ノ╰(*´︶`*)╯(￣▽￣)( ´ ▽ ` )o(≧▽≦)o(☆ω☆)(っ˘ω˘ς )＼(￣▽￣)／(*¯︶¯*)＼(＾▽＾)／٩(◕‿◕)۶(o˘◡˘o)(╯✧▽✧)╯(〃＾▽＾〃)\(^ヮ^)/\(★ω★)/o(>ω<)oo( ❛ᴗ❛ )o｡ﾟ(TヮT)ﾟ｡( ‾́ ◡ ‾́ )(๑˘︶˘๑)(๑˃ᴗ˂)ﻭ(b ᵔ▽ᵔ)b(ﾉ´ヮ`)ﾉ*: ･ﾟ( ˙꒳​˙ )°˖✧◝(⁰▿⁰)◜✧˖°(ﾉ◕ヮ◕)ﾉ*:･ﾟ✧(ﾉ◕ヮ◕)ﾉ*:･ﾟ✧(￢‿￢ )(⁀ᗢ⁀)(.❛ ᴗ ❛.)(„• ֊ •„)(¬‿¬ )(˵¯̴͒ꇴ¯̴͒˵)✧(σ๑˃̶̀ꇴ˂̶́)σ٩̋(๑˃́ꇴ˂̀๑)(ꐦ ´͈ ᗨ `͈ )(◍˃̶ᗜ˂̶◍)ﾉ”(っ˘ڡ˘ς)(≧ڡ≦*)°˖✧◝(⁰▿⁰)◜✧˖°(ﾉ◕ヮ◕)ﾉ*:･ﾟ✧( ˙꒳​˙ )(ﾉ´ヮ`)ﾉ*: ･ﾟ｡ﾟ(TヮT)ﾟ｡o( ❛ᴗ❛ )oo(>ω<)o\(★ω★)/٩(◕‿◕)۶＼(＾▽＾)／(⊃｡•́‿•̀｡)⊃ʕっ•ᴥ•ʔっ(⊃ • ʖ̫ • )⊃(づ￣ ³￣)づ(づ￣ ³￣)づ༼ つ ◕‿◕ ༽つ(づ｡◕‿‿◕｡)づ⊂((・▽・))⊃(つ≧▽≦)つ(つ✧ω✧)つ(っ.❛ ᴗ ❛.)っ～(つˆДˆ)つ｡☆ლ(´ ❥ `ლ)⊂(•‿•⊂ )*.✧⊂(´･◡･⊂ )∘˚˳°⊂(･ω･*⊂)⊂(・﹏・⊂)⊂(・▽・⊂)⊂(◉‿◉)つo((*^▽^*))o╰(*´︶`*)╯╰(＾3＾)╯╰(⸝⸝⸝´꒳`⸝⸝⸝)╯♡(˃͈ દ ˂͈ ༶ )╰(*´︶`*)╯╰(＾3＾)╯╰(⸝⸝⸝´꒳`⸝⸝⸝)╯♡(˃͈ દ ˂͈ ༶ )ヾ(˙❥˙)ﾉ＼(^o^)／ლ(・﹏・ლ)ლ(◕ω◕ლ)(/･ω･(-ω-)(･ω･)つ⊂(･ω･)( T_T)＼(^-^ )(･–･) \(･◡･)/(づ￣ ³￣)づ(つ≧▽≦)つ(つ✧ω✧)つ(づ ◕‿◕ )づ(⊃｡•́‿•̀｡)⊃(つ . •́ _ʖ •̀ .)つ(っಠ‿ಠ)っ(づ◡﹏◡)づ⊂(´• ω •`⊂)⊂(･ω･*⊂)⊂(￣▽￣)⊃⊂( ´ ▽ ` )⊃(⊃｡•́‿•̀｡)⊃(つ . •́ _ʖ •̀ .)つ(っಠ‿ಠ)っ(づ◡﹏◡)づ⊂(´• ω •`⊂)⊂(･ω･*⊂)⊂(￣▽￣)⊃⊂( ´ ▽ ` )⊃(*•̀ᴗ•́*)و ̑̑╭( ･ㅂ･)و ̑̑(๑•̀ㅂ•́)و(๑˃̵ᴗ˂̵)و╭( ･ㅂ･)و( •̀ᄇ• ́)ﻭ✧(ര̀ᴗര́)و ̑̑╭(♡･ㅂ･)و ̑̑◝( ′ㅂ`)و ̑̑╭( ･ㅂ･)و ̑̑ ＂╭( ･ㅂ･)و )))╭(๑ ॔ㅂ ਂ ॓)و ̑̑( ⁼̴̤̆ ළ̉ ⁼̴̤̆)و ̑̑(๑˃̵ᴗ˂̵)و(๑•̀ㅂ•́)و✧꒰๑͒•̀ुꇵ͒•꒱و ̑̑ଘ꒰ ๑ ˃̶ ᴗ ᵒ̴̶̷๑꒱و ̑̑(ฅ⁍̴̀◊⁍̴́)و ̑̑(•́⌄•́๑)૭✧(•̀ᴗ•́)൬༉!(•̀ᴗ•́)و ̑̑(•̀o•́)ง٩(｡•ω•｡)و٩(⸝⸝⸝◕ั ௰ ◕ั⸝⸝⸝ )و٩(✪ꀾ⍟༶)و୧( ⁼̴̶̤̀ω⁼̴̶̤́ )૭٩(˃̶͈̀௰˂̶͈́)و٩( ‘ω’ )و(•́⌄•́๑)૭✧ヾ(・ω・)メ(・ω・)ノヽ(∀° )人( °∀)ノヽ( ⌒o⌒)人(⌒-⌒ )ﾉ(*^ω^)八(⌒▽⌒)八(-‿‿- )ヽ＼(＾∀＾)メ(＾∀＾)ノヾ(￣ー￣(≧ω≦*)ゝヽ( ⌒ω⌒)人(=^‥^= )ﾉヽ(≧◡≦)八(o^ ^o)ノ(*・∀・)爻(・∀・*)(＾• ω •＾)(＾• ω •＾)(＾• ω •＾)(＾• ω •＾)(＾• ω •＾)(＾• ω •＾)(＾• ω •＾)(＾• ω •＾)ଲ(ⓛ ω ⓛ)ଲヾ(=`ω´=)ノ”ヾ(=`ω´=)ノ”ヾ(=`ω´=)ノ”ヾ(=`ω´=)ノ”ヾ(=`ω´=)ノ”ヾ(=`ω´=)ノ”ヾ(=`ω´=)ノ”ヾ(=`ω´=)ノ”ヾ(=`ω´=)ノ”ヾ(=`ω´=)ノ”(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )ヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥(•‿•)(・∀・)◉‿◉｡◕‿◕｡(. ❛ ᴗ ❛.)(θ‿θ)(✷‿✷)(◔‿◔)(◕ᴗ◕✿)(ʘᴗʘ✿)(人 •͈ᴗ•͈)(◍•ᴗ•◍)( ╹▽╹ )(≧▽≦)(☆▽☆)(✯ᴗ✯)( ╹▽╹ )(≧▽≦)(☆▽☆)(✯ᴗ✯)ಡ ͜ ʖ ಡ(ㆁωㆁ)(*´ω｀*)( ꈍᴗꈍ)(✿^‿^)^_________^(◡ ω ◡)( ´◡‿ゝ◡`)(｡•̀ᴗ-)✧✧◝(⁰▿⁰)◜✧(◠‿・)—☆٩(◕‿◕｡)۶(´ ∀ ` *)(* ^ ω ^)(o^▽^o)(￣ω￣)(o･ω･o)ヽ(*・ω・)ﾉヽ(*・ω・)ﾉ(o´▽`o)(o_ _)ﾉ彡☆(o_ _)ﾉ彡☆(＠＾◡＾)ヽ(*・ω・)ﾉ(o_ _)ﾉ彡☆(^人^)(o´▽`o)(*´▽`*)｡ﾟ( ﾟ^∀^ﾟ)ﾟ｡( ´ ω ` )(((o(*°▽°*)o)))(≧◡≦)(⌒ω⌒)(＾▽＾)(´• ω •`)(o´∀`o)∑d(°∀°d)╰(▔∀▔)╯(─‿‿─)(*^‿^*)ヽ(o^ ^o)ﾉ(✯◡✯)(◕‿◕)(*≧ω≦*)ヽ(o＾▽＾o)ノ＼(≧▽≦)／(⌒‿⌒)(☆▽☆)(*°▽°*)(✧ω✧)ヽ(*⌒▽⌒*)ﾉ(´｡• ᵕ •｡`)ヽ(>∀<☆)ノ╰(*´︶`*)╯(￣▽￣)( ´ ▽ ` )o(≧▽≦)o(☆ω☆)(っ˘ω˘ς )＼(￣▽￣)／(*¯︶¯*)＼(＾▽＾)／٩(◕‿◕)۶(o˘◡˘o)(╯✧▽✧)╯(〃＾▽＾〃)\(^ヮ^)/\(★ω★)/o(>ω<)oo( ❛ᴗ❛ )o｡ﾟ(TヮT)ﾟ｡( ‾́ ◡ ‾́ )(๑˘︶˘๑)(๑˃ᴗ˂)ﻭ(b ᵔ▽ᵔ)b(ﾉ´ヮ`)ﾉ*: ･ﾟ( ˙꒳​˙ )°˖✧◝(⁰▿⁰)◜✧˖°(ﾉ◕ヮ◕)ﾉ*:･ﾟ✧(ﾉ◕ヮ◕)ﾉ*:･ﾟ✧(￢‿￢ )(⁀ᗢ⁀)(.❛ ᴗ ❛.)(„• ֊ •„)(¬‿¬ )(˵¯̴͒ꇴ¯̴͒˵)✧(σ๑˃̶̀ꇴ˂̶́)σ٩̋(๑˃́ꇴ˂̀๑)(ꐦ ´͈ ᗨ `͈ )(◍˃̶ᗜ˂̶◍)ﾉ”(っ˘ڡ˘ς)(≧ڡ≦*)°˖✧◝(⁰▿⁰)◜✧˖°(ﾉ◕ヮ◕)ﾉ*:･ﾟ✧( ˙꒳​˙ )(ﾉ´ヮ`)ﾉ*: ･ﾟ｡ﾟ(TヮT)ﾟ｡o( ❛ᴗ❛ )oo(>ω<)o\(★ω★)/٩(◕‿◕)۶＼(＾▽＾)／(⊃｡•́‿•̀｡)⊃ʕっ•ᴥ•ʔっ(⊃ • ʖ̫ • )⊃(づ￣ ³￣)づ(づ￣ ³￣)づ༼ つ ◕‿◕ ༽つ(づ｡◕‿‿◕｡)づ⊂((・▽・))⊃(つ≧▽≦)つ(つ✧ω✧)つ(っ.❛ ᴗ ❛.)っ～(つˆДˆ)つ｡☆ლ(´ ❥ `ლ)⊂(•‿•⊂ )*.✧⊂(´･◡･⊂ )∘˚˳°⊂(･ω･*⊂)⊂(・﹏・⊂)⊂(・▽・⊂)⊂(◉‿◉)つo((*^▽^*))o╰(*´︶`*)╯╰(＾3＾)╯╰(⸝⸝⸝´꒳`⸝⸝⸝)╯♡(˃͈ દ ˂͈ ༶ )╰(*´︶`*)╯╰(＾3＾)╯╰(⸝⸝⸝´꒳`⸝⸝⸝)╯♡(˃͈ દ ˂͈ ༶ )ヾ(˙❥˙)ﾉ＼(^o^)／ლ(・﹏・ლ)ლ(◕ω◕ლ)(/･ω･(-ω-)(･ω･)つ⊂(･ω･)( T_T)＼(^-^ )(･–･) \(･◡･)/(づ￣ ³￣)づ(つ≧▽≦)つ(つ✧ω✧)つ(づ ◕‿◕ )づ(⊃｡•́‿•̀｡)⊃(つ . •́ _ʖ •̀ .)つ(っಠ‿ಠ)っ(づ◡﹏◡)づ⊂(´• ω •`⊂)⊂(･ω･*⊂)⊂(￣▽￣)⊃⊂( ´ ▽ ` )⊃(⊃｡•́‿•̀｡)⊃(つ . •́ _ʖ •̀ .)つ(っಠ‿ಠ)っ(づ◡﹏◡)づ⊂(´• ω •`⊂)⊂(･ω･*⊂)⊂(￣▽￣)⊃⊂( ´ ▽ ` )⊃(*•̀ᴗ•́*)و ̑̑╭( ･ㅂ･)و ̑̑(๑•̀ㅂ•́)و(๑˃̵ᴗ˂̵)و╭( ･ㅂ･)و( •̀ᄇ• ́)ﻭ✧(ര̀ᴗര́)و ̑̑╭(♡･ㅂ･)و ̑̑◝( ′ㅂ`)و ̑̑╭( ･ㅂ･)و ̑̑ ＂╭( ･ㅂ･)و )))╭(๑ ॔ㅂ ਂ ॓)و ̑̑( ⁼̴̤̆ ළ̉ ⁼̴̤̆)و ̑̑(๑˃̵ᴗ˂̵)و(๑•̀ㅂ•́)و✧꒰๑͒•̀ुꇵ͒•꒱و ̑̑ଘ꒰ ๑ ˃̶ ᴗ ᵒ̴̶̷๑꒱و ̑̑(ฅ⁍̴̀◊⁍̴́)و ̑̑(•́⌄•́๑)૭✧(•̀ᴗ•́)൬༉!(•̀ᴗ•́)و ̑̑(•̀o•́)ง٩(｡•ω•｡)و٩(⸝⸝⸝◕ั ௰ ◕ั⸝⸝⸝ )و٩(✪ꀾ⍟༶)و୧( ⁼̴̶̤̀ω⁼̴̶̤́ )૭٩(˃̶͈̀௰˂̶͈́)و٩( ‘ω’ )و(•́⌄•́๑)૭✧ヾ(・ω・)メ(・ω・)ノヽ(∀° )人( °∀)ノヽ( ⌒o⌒)人(⌒-⌒ )ﾉ(*^ω^)八(⌒▽⌒)八(-‿‿- )ヽ＼(＾∀＾)メ(＾∀＾)ノヾ(￣ー￣(≧ω≦*)ゝヽ( ⌒ω⌒)人(=^‥^= )ﾉヽ(≧◡≦)八(o^ ^o)ノ(*・∀・)爻(・∀・*)(＾• ω •＾)(＾• ω •＾)(＾• ω •＾)(＾• ω •＾)(＾• ω •＾)(＾• ω •＾)(＾• ω •＾)(＾• ω •＾)ଲ(ⓛ ω ⓛ)ଲヾ(=`ω´=)ノ”ヾ(=`ω´=)ノ”ヾ(=`ω´=)ノ”ヾ(=`ω´=)ノ”ヾ(=`ω´=)ノ”ヾ(=`ω´=)ノ”ヾ(=`ω´=)ノ”ヾ(=`ω´=)ノ”ヾ(=`ω´=)ノ”ヾ(=`ω´=)ノ”(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^=◕ᴥ◕=^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◔ᴥ◔^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^)(^◕ᴥ◕^༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ༼ つ ◕‿◕ ༽つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ⊂(◉‿◉)つ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )づ(づ ◕‿◕ )ヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥˙)ﾉヾ(˙❥





















function Field()
gg.clearResults()
gg.setRanges(gg.REGION_OTHER | gg.REGION_C_ALLOC) 
gg.searchNumber(":"..Class,1)
    if gg.getResultsCount()==0 then E=0 return end 
apexu=nil apexu=gg.getResults(1)
gg.getResults(gg.getResultsCount())
gg.refineNumber(tonumber(apexu[1].value),1)
apexu=nil apexu=gg.getResults(gg.getResultsCount())
gg.clearResults()
    for i, v in ipairs(apexu) do apexu[i].address=apexu[i].address-1 apexu[i].flags=1
    end
apexu=gg.getValues(apexu) apexa={} apexaa=1 
    for i, v in pairs(apexu) do
        if apexu[i].value==0 then
        apexa[apexaa]={} apexa[apexaa].address=apexu[i].address apexa[apexaa].flags=1 apexaa=apexaa+1
        end
    end   
if #(apexa)==0 then gg.clearResults() E=0 return end 
u=nil
    for i, v in ipairs(apexa) do apexa[i].address=apexa[i].address+#(Class)+1 apexa[i].flags=1
    end  
apexa=gg.getValues(apexa) apexs=nil apexs={} apexbb=1
    for i, v in ipairs(apexa) do
        if apexa[i].value==0 then apexs[apexbb]={} apexs[apexbb].address=apexa[i].address apexs[apexbb].flags=1 apexbb=apexbb+1
        end
    end
if #(apexs)==0 then gg.clearResults() E=0 return end 
apexa=nil
    for i, v in ipairs(apexs) do apexs[i].address=apexs[i].address-#(Class) apexs[i].flags=1
    end
gg.loadResults(apexs) 
apexrange=nil apexrange=gg.getResults(gg.getResultsCount())
apexrca=nil apexrca=0 apexro=nil apexro=0 apexra=nil 
    for i, v in ipairs(apexrange) do
        apexra=gg.getValuesRange(apexrange[i])
        if apexra.address=="Ca" then apexrca=1 end
        if apexra.address=="O" then apexro=1 end
        apexra=nil 
    end 
if apexrca==1 and apexro==0 then gg.setRanges(gg.REGION_C_ALLOC) end
if apexrca==0 and apexro==1 then gg.setRanges(gg.REGION_OTHER) end 
apexrca=nil apexro=nil apexra=nil 
gg.searchPointer(0)
if gg.getResultsCount()==0 then E=0 return end   
apexu=gg.getResults(gg.getResultsCount())
gg.clearResults() 
if gg.getTargetInfo().x64 then apexo1=48 apexo2=56 apexvt=32 else apexo1=24 apexo2=28 apexvt=4 end
ERROR=0 
::TRYAGAIN:: 
apexy=nil apexy={} apexz=nil apexz={} 
    for i, v in ipairs(apexu) do
    apexy[i]={} apexy[i].address=apexu[i].address+apexo1 apexy[i].flags=apexvt
    apexz[i]={} apexz[i].address=apexu[i].address+apexo2 apexz[i].flags=apexvt
    end 
apexy=gg.getValues(apexy) apexz=gg.getValues(apexz) apexp=nil apexp={} apexxx=1
    for i, v in ipairs(apexy) do
        if apexy[i].value==apexz[i].value and #(tostring(apexy[i].value))>=8 then
        apexp[apexxx]=apexy[i].value
        apexxx=apexxx+1
        end
    end
apexxx=nil apexy=nil apexz=nil
    if #(apexp)==0 and ERROR==0 then
        if gg.getTargetInfo().x64 then apexo1=32 apexo2=40 else apexo1=16 apexo2=20 end 
    ERROR=2 
    goto TRYAGAIN
    end    
if #(apexp)==0 and ERROR==2 then E=0 return end
gg.setRanges(gg.REGION_ANONYMOUS) 
gg.clearResults() apexxxx=1
    for i, v in ipairs(apexp) do
    gg.toast("♥ᴍᴏᴅ ʙʏ ʜᴀ̉ɪ sᴄʀɪᴘᴛ♥") 
    gg.searchNumber(tonumber(apexp[i]),apexvt)
        if gg.getResultsCount()~=0 then
        apexxx=nil apexxx=gg.getResults(gg.getResultsCount()) gg.clearResults()
            for apexq=1,#(apexxx) do apexxx[apexq].name="HNHH"
            end
        gg.addListItems(apexxx) apexxxx=apexxxx+1
        end
    gg.clearResults()
    end 
apexu=nil apexp=nil apexxx=nil apexq=nil 
if apexxxx==1 then gg.clearResults() E=0 return end
apexxxx=nil apexload={} apexremove={} apexxx=1
apexu=gg.getListItems()
    for i, v in ipairs(apexu) do
        if apexu[i].name=="HNHH" then 
        apexload[apexxx]={} apexload[apexxx].address=apexu[i].address+Offset apexload[apexxx].flags=Type
        apexremove[apexxx]={} apexremove[apexxx]=apexu[i] apexxx=apexxx+1
        end
    end 
apexload=gg.getValues(apexload) gg.loadResults(apexload) gg.removeListItems(apexremove) 
end



while true do
  if gg.isVisible(true)then
    gg.setVisible(false) HVH = 1
  end
  if HVH == 1 then MenuBattle()end
end
--❏━━━━━━━━━━━━━━❒
